Hey @dombisza , @anton-sidelnikov  

we find another change in the Endpoints, and I would believe there are more.
So the `terraform plan` comes up with a plan, but as we want to apply we got an error:

**CODE**
```code
resource "opentelekomcloud_vpc_v1" "MKE-MOCK" {
  name = var.MKE-MOCK
  cidr = var.MKE-MOCK_cidr
}
```

**STACK**
``` shell
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_vpc_v1.MKE-MOCK will be created
  + resource "opentelekomcloud_vpc_v1" "MKE-MOCK" {
      + cidr   = "10.0.0.0/16"
      + id     = (known after apply)
      + name   = "MKE-MOCK"
      + region = (known after apply)
      + shared = (known after apply)
      + status = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_vpc_v1.MKE-MOCK: Creating...
╷
│ Error: error creating OpenTelekomCloud VPC: Resource not found: [POST https://vpc.eu-ch2.sc.otc.t-systems.com/v1//vpcs], error message: {"error_msg":"The API does not exist or has not been published in the environment","error_code":"APIGW.0101","request_id":"6ea58f08dfe8f105f2b5f763ab20c593"}
│
│
│   with opentelekomcloud_vpc_v1.MKE-MOCK,
│   on main.tf line 2, in resource "opentelekomcloud_vpc_v1" "MKE-MOCK":
│    2: resource "opentelekomcloud_vpc_v1" "MKE-MOCK" {
```